# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

n = input()
m = input()

print(n.count(m)) # кол-во вхождений m в n